Repository: alphamikle/localization_battle
Catalog: assets/i18n/flutter_localizations/app_*.arb
Languages: es, ru

# appTitle
source: Library App
es: Aplicación de Biblioteca
ru: Библиотека

# language
source: Lang: {language}
es: Idioma: {language}
ru: Язык: {language}

# mainScreenGreetings
source: Hello, {username}
es: ¡Hola, {username}!
ru: Привет, {username}!

# mainScreenBooksAdd
source: Add Book
es: Añadir libro
ru: Добавить книгу

# mainScreenBooksAmountOfNew
source: {howMany, plural, zero{There are no new books available at the moment :(} one{There is {howMany} new book available :)} other{There are {howMany} new books available :)}}
es: {howMany, plural, zero{No hay libros nuevos disponibles en este momento :(} one{Hay {howMany} libro nuevo disponible :)} other{Hay {howMany} libros nuevos disponibles :)}}
ru: {howMany, plural, zero{В настоящий момент доступных новых книг нет :(} one{В настоящий момент доступна {howMany} новая книга :)} two{В настоящий момент доступны {howMany} новые книги :)} few{В настоящий момент доступно {howMany} новые книги :)} many{В настоящий момент доступно {howMany} новых книг :)} other{В настоящий момент доступно {howMany} новые книги :)}}

# mainScreenBooksTodayDateFormat
source: dd/MM/yyyy
ru: dd MMM yyyy

# mainScreenBooksWelcome
source: # Welcome to our library! --- ## We are very happy to see you and would like you to enjoy reading our books.
es: # ¡Bienvenido a nuestra biblioteca! --- ## Estamos muy contentos de verte y nos gustaría que disfrutes leyendo nuestros libros.
ru: # Добро пожаловать в нашу библиотеку! --- ## Мы очень рады вас видеть и хотели бы, чтобы вы получали удовольствие от чтения наших книг.

# author
source: {gender, select, male{{name} - he is the author of that book!} female{{name} - she is the author of that book!} other{{name} - they are the author of that book!}}
es: {gender, select, male{¡{name} es el autor de ese libro!} female{¡{name} es la autora de ese libro!} other{¡{name} es el autor de ese libro!}}
ru: {gender, select, male{{name} - он автор этой книги!} female{{name} - она автор этой книги!} other{{name} - автор этой книги!}}

# privacyPolicyUrl
source: https://library.app/privacy_ca.pdf
es: https://library.app/privacy_mx.pdf
ru: https://library.app/privacy_ru.pdf

# employees0
source: John Smith
es: Juan Smith
ru: Джон Смит

# employees1
source: Alice Johnson
es: Alicia Johnson
ru: Алиса Джонсон

# employees2
source: Michael Brown
es: Miguel Brown
ru: Майкл Браун

# employees3
source: Emma Davis
ru: Эмма Дэвис

# employees4
source: William Taylor
es: Guillermo Taylor
ru: Уильям Тейлор
